app/controllers/api/lots_controller.rb

SELECT "lots".* FROM "lots" WHERE (permit = 'purple')
---
	def show
		@permit = current_user.permit
		@lots = Lot.where("permit = ?", @permit)