app/controllers/api/microposts_controller.rb

SELECT "microposts".* FROM "microposts" ORDER BY created_at DESC
---
	def index
		@microposts = Micropost.all

SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'tD092Mu6ivICz5AP_XMWSA' LIMIT 1
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Lorem ipsum"], ["created_at", Fri, 17 Jan 2014 04:22:44 UTC +00:00], ["updated_at", Fri, 17 Jan 2014 04:22:44 UTC +00:00], ["user_id", 105]]
---
	def create
		@cur_user = User.find_by(remember_token: params[:token])

		@micropost = @cur_user.microposts.build(micropost_params)
		if @micropost.save