app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'ikecolleg@gmail.com' LIMIT 1
---
	def create
		user = User.find_by(email: params[:email].downcase)