app/controllers/api/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		respond_to do |format|
			if @user.save

UPDATE "users" SET "password_digest" = ?, "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = 101  [["password_digest", "$2a$10$GrOYa6AWZ5q6KXaouqW7/e/jHT/DvRvutyEbwyYiGkM848/VvHw1C"], ["remember_token", "BEkIG8S0F-9rbf4d07pfjg"], ["updated_at", Thu, 16 Jan 2014 03:34:32 UTC +00:00]]
---
	def update
		respond_to do |format|
			if @user.update_attributes(user_params)