app/views/users/show.html.erb

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]
---
  <div class="span8">
  	<% if @user.microposts.any? %>